src/cf/InformationRegisters/НастройкиПодключенияЛокальныхМодулейМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПодключенияЛокальныхМодулейМДЛП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АдресПодключенияЛМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбменНаСервере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СерверПодключенияЛМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортПодключенияЛМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьФорматОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВерсииФорматаОбменаЛокальногоМодуляИСМП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВерсииФорматаОбменаЛокальногоМодуляМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииМДЛП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ВерсииФорматаОбменаЛокальногоМодуляМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВерсииФорматаОбменаЛокальногоМодуляМДЛП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>V1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>V2</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиПодключенияЛокальныхМодулейМДЛП/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Запись.ИсходныйКлючЗаписи.Пустой() Тогда
		
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			
			//@skip-check assign-form-attribute
			Пароль           = РегистрыСведений.НастройкиПодключенияЛокальныхМодулейМДЛП.ПарольАдминистратораИзБезопасногоХранилища(Запись.ХешСумма);
			Запись.Приоритет = РегистрыСведений.НастройкиПодключенияЛокальныхМодулейМДЛП.НомерПриоритетаНастройкиПодключения(Запись.Организация, Запись.РабочееМесто);
			
		КонецЕсли;
		
		ПриСозданииЧтенииНаСервере();
		
	КонецЕсли;
	
	УправлениеВидимостьюДоступностью(ЭтотОбъект);
	
	ОбменНаСервере = ?(Запись.ОбменНаСервере, 0, 1);
	
	Элементы.СтраницыПроверкаПодключения.ТекущаяСтраница = Элементы.СтраницаПроверкаНеВыполнялась;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента();
	
	ТекущееРабочееМесто = МенеджерОборудованияКлиент.РабочееМестоКлиента();
	
	ОбновитьДанныеПодключенияПоДаннымЛокальногоМодуля();
	ПроверитьНастройкиПодключения();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	//@skip-check assign-form-attribute
	Пароль = РегистрыСведений.НастройкиПодключенияЛокальныхМодулейМДЛП.ПарольАдминистратораИзБезопасногоХранилища(ТекущийОбъект.ХешСумма);
	
	ПриСозданииЧтенииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СтруктураТекущейЗаписи  = Новый Структура();
	СтруктураИсходнойЗаписи = Новый Структура();
	
	Для Каждого ИзмерениеРегистра Из Метаданные.РегистрыСведений.НастройкиПодключенияЛокальныхМодулейМДЛП.Измерения Цикл
		СтруктураТекущейЗаписи.Вставить(ИзмерениеРегистра.Имя);
	КонецЦикла;
	
	СтруктураИсходнойЗаписи = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураТекущейЗаписи);
	
	ЗаполнитьЗначенияСвойств(СтруктураТекущейЗаписи, Запись);
	ЗаполнитьЗначенияСвойств(СтруктураИсходнойЗаписи, Запись.ИсходныйКлючЗаписи);
	
	КлючевыеПоляИзменены = Не ОбщегоНазначения.КоллекцииИдентичны(СтруктураТекущейЗаписи, СтруктураИсходнойЗаписи);
	
	Если Запись.ИсходныйКлючЗаписи.Пустой() Или КлючевыеПоляИзменены Тогда
		
		ТекущийОбъект.Приоритет = РегистрыСведений.НастройкиПодключенияЛокальныхМодулейМДЛП.НомерПриоритетаНастройкиПодключения(
			ТекущийОбъект.Организация,
			ТекущийОбъект.РабочееМесто);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	РегистрыСведений.НастройкиПодключенияЛокальныхМодулейМДЛП.СохранитьПарольАдминистратораВБезопасноеХранилище(
		ТекущийОбъект.ХешСумма, Пароль);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьЗначенияПриоритетовНастроек(ЭтотОбъект);
	ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(Параметры.Ключ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ИдетДлительнаяОперацияНастройки И Не ЗавершениеРаботы Тогда
		
		Отказ = Истина;
		ТекстВопроса = НСтр("ru = 'Настройка подключения не окончена.
								   |Дождаться завершения операции?'");
								   
		ПослеПодтвержденияЗавершения = Новый ОписаниеОповещения("ПослеПодтвержденияЗавершенияНастройки", ЭтотОбъект);
		ПоказатьВопрос(ПослеПодтвержденияЗавершения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	
	Модифицированность = Истина;
	ПроверитьНастройкиПодключения();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗащищенноеСоединениеПриИзменении(Элемент)
	
	ПроверитьНастройкиПодключения();
	
КонецПроцедуры

&НаКлиенте
Процедура СерверПодключенияЛМПриИзменении(Элемент)
	
	ПроверитьНастройкиПодключения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПортПодключенияЛМПриИзменении(Элемент)
	
	ПроверитьНастройкиПодключения();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛогинПриИзменении(Элемент)
	
	ПроверитьНастройкиПодключения();
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПроверкаНеВыполненаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ОбработатьНавигационнуюСсылку(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьНастройкаНеВыполненаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ОбработатьНавигационнуюСсылку(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПроверкаНеВыполняласьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ОбработатьНавигационнуюСсылку(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбменНаСервереПриИзменении(Элемент)
	
	Если ОбменНаСервере = 1 Тогда
		Запись.ОбменНаСервере = Ложь;
	Иначе
		Запись.ОбменНаСервере = Истина;
	КонецЕсли;
	
	ПроверитьНастройкиПодключения();
	
	УправлениеВидимостьюДоступностью(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьЗапуститьПроцессНастройкиНажатие(Элемент)
	
	Если Модифицированность Тогда
		
		ПослеПодтвержденияЗаписи = Новый ОписаниеОповещения("ПослеПодтвержденияЗапускаИнициализацииЛокальногоМодуля", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Для начала инициализации требуется записать настройку подключения.
							|Продолжить?'");
		ПоказатьВопрос(ПослеПодтвержденияЗаписи, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		
	Иначе
		
		ЗапуститьПроцессИнициализацииЛокальногоМодуля();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПроверитьСтатусНажатие(Элемент)
	
	ЗакончитьПолучениеСтатуса = Ложь;
	ЗапущеноОжиданиеСтатуса   = Ложь;
	
	Если Модифицированность Тогда
		
		ПослеПодтвержденияЗаписи = Новый ОписаниеОповещения("ПослеПодтвержденияПолученияСтатусаЛокальногоМодуля", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Для продолжения настройки требуется записать настройку подключения.
							|Продолжить?'");
		ПоказатьВопрос(ПослеПодтвержденияЗаписи, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		
	Иначе
		
		ЗапуститьПроверкуСтатусаЛогинаПароляАдминистратораЛокальногоМодуля(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФорматОбменаПриИзменении(Элемент)
	
	ПроверитьНастройкиПодключения();
	УправлениеПодсказкойФорматОбмена(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ФорматОбменаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.ВерсииФорматаОбменаЛокальногоМодуляМДЛП.V2")
		И Запись.ФорматОбмена = ПредопределенноеЗначение("Перечисление.ВерсииФорматаОбменаЛокальногоМодуляМДЛП.V1") Тогда
		
		МассивСтрок = Новый Массив;
		МассивСтрок.Добавить(НСтр("ru = 'Для смены формата обмена необходимо удаление предыдущей версии и установка новой версии Локального модуля Честного знака.'"));
		МассивСтрок.Добавить(Символы.ПС);
		МассивСтрок.Добавить(НСтр("ru = 'Актуальные релизы размещены на'"));
		МассивСтрок.Добавить(" ");
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'официальном сайте'"),,,, "https://xn--80ajghhoc2aj1c8b.xn--p1ai/local-module/"));
		
		ДополнительныеПараметры = Новый Структура();
		ДополнительныеПараметры.Вставить("НовоеЗначение", ВыбранноеЗначение);
		
		ПослеПрочтенияИнформационногоСообщения = Новый ОписаниеОповещения("ПослеПодтвержденияУстановкиНовогоДистрибутиваЛМЧЗ", ЭтотОбъект, ДополнительныеПараметры);
		ФорматированнаяСтрокаСообщения         = Новый ФорматированнаяСтрока(МассивСтрок);
		
		Кнопки = Новый СписокЗначений();
		Кнопки.Добавить(КодВозвратаДиалога.ОК, НСтр("ru = 'Продолжить'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		
		СтандартнаяОбработка = Ложь;
		ПоказатьВопрос(ПослеПрочтенияИнформационногоСообщения, ФорматированнаяСтрокаСообщения, Кнопки);
		
	Иначе
		УправлениеПодсказкойФорматОбмена(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Изменить(Команда)
	
	ПослеИзмененияПароля = Новый ОписаниеОповещения("ПослеИзмененияПароляЛокальногоМодуля", ЭтотОбъект);
	ОткрытьФорму("РегистрСведений.НастройкиПодключенияЛокальныхМодулейМДЛП.Форма.ФормаВводаНовогоПароля",,
		ЭтотОбъект,,,,
		ПослеИзмененияПароля,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗапуститьПроверкуСтатусаЛогинаПароляАдминистратораЛокальногоМодуля(ОжидатьПолучениеСтатусаГотовности = Ложь)
	
	Если ОжидатьПолучениеСтатусаГотовности Тогда
		Элементы.СтраницыПроверкаПодключения.ТекущаяСтраница = Элементы.СтраницаИдетНастройка;
	Иначе
		Элементы.СтраницыПроверкаПодключения.ТекущаяСтраница = Элементы.СтраницаПроверкаВыполняется;
	КонецЕсли;
	
	ОбновитьДанныеПодключенияПоДаннымЛокальногоМодуля();
	
	ДополнительныеПараметры = Новый Структура("ОжидатьПолучениеСтатусаГотовности", ОжидатьПолучениеСтатусаГотовности);
	ПослеВыполненияОбновления = Новый ОписаниеОповещения("ПослеВыполненияПроверкиЛогинаПароляАдминистратора", ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыУстановки = РазрешительныйРежимМДЛПКлиентСервер.ПараметрыПодключенияЛокальногоМодуляЧЗ();
	ПараметрыУстановки.Адрес                = Запись.СерверПодключенияЛМ;
	ПараметрыУстановки.ЗащищенноеСоединение = Запись.ЗащищенноеСоединение;
	ПараметрыУстановки.Порт                 = Запись.ПортПодключенияЛМ;
	ПараметрыУстановки.Логин                = Запись.Логин;
	ПараметрыУстановки.ФорматОбмена         = Запись.ФорматОбмена;
	ПараметрыУстановки.Пароль               = Пароль;
	
	ПараметрыОбработки = Новый Структура();
	ПараметрыОбработки.Вставить("Организация",            Запись.Организация);
	ПараметрыОбработки.Вставить("ПараметрыУстановки",     ПараметрыУстановки);
	ПараметрыОбработки.Вставить("НеВыводитьОкноОжидания", Истина);
	
	ПараметрыЗапроса                         = РазрешительныйРежимМДЛПКлиент.ПараметрыЗапросаДанных();
	ПараметрыЗапроса.ОповещениеОЗавершении   = ПослеВыполненияОбновления;
	ПараметрыЗапроса.УникальныйИдентификатор = УникальныйИдентификатор;
	ПараметрыЗапроса.Параметры               = ПараметрыОбработки;
	ПараметрыЗапроса.Организация             = Запись.Организация;
	ПараметрыЗапроса.ВыполнениеНаКлиенте     = Не Запись.ОбменНаСервере;
	
	РазрешительныйРежимМДЛПКлиент.ОбновитьСтатусЛокальнойКонфигурацииЛМЧЗ(ПараметрыЗапроса);
	
	Если ОжидатьПолучениеСтатусаГотовности И Не ЗапущеноОжиданиеСтатуса Тогда
		
		ПодключитьОбработчикОжидания("ЗавершитьОжиданиеПереходаСистемыВСтатусГотовности", 120, Истина);
		ЗапущеноОжиданиеСтатуса = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьПроцессИнициализацииЛокальногоМодуля()
	
	Элементы.СтраницыПроверкаПодключения.ТекущаяСтраница = Элементы.СтраницаИдетНастройка;
	ИдетДлительнаяОперацияНастройки = Истина;
	
	ПослеВыполненияОбновления = Новый ОписаниеОповещения("ПослеВыполненияЭтапаИнициализации", ЭтотОбъект);
	
	ПараметрыУстановки = РазрешительныйРежимМДЛПКлиентСервер.ПараметрыПодключенияЛокальногоМодуляЧЗ();
	ПараметрыУстановки.Адрес                = Запись.СерверПодключенияЛМ;
	ПараметрыУстановки.ЗащищенноеСоединение = Запись.ЗащищенноеСоединение;
	ПараметрыУстановки.Порт                 = Запись.ПортПодключенияЛМ;
	ПараметрыУстановки.Логин                = Запись.Логин;
	ПараметрыУстановки.ФорматОбмена         = Запись.ФорматОбмена;
	ПараметрыУстановки.Пароль               = Пароль;
	
	ПараметрыОбработки = Новый Структура();
	ПараметрыОбработки.Вставить("Организация",            Запись.Организация);
	ПараметрыОбработки.Вставить("ПараметрыУстановки",     ПараметрыУстановки);
	ПараметрыОбработки.Вставить("НеВыводитьОкноОжидания", Истина);
	
	ПараметрыЗапроса                         = РазрешительныйРежимМДЛПКлиент.ПараметрыЗапросаДанных();
	ПараметрыЗапроса.ОповещениеОЗавершении   = ПослеВыполненияОбновления;
	ПараметрыЗапроса.УникальныйИдентификатор = УникальныйИдентификатор;
	ПараметрыЗапроса.Параметры               = ПараметрыОбработки;
	ПараметрыЗапроса.Организация             = Запись.Организация;
	ПараметрыЗапроса.ВыполнениеНаКлиенте     = Не Запись.ОбменНаСервере;
	
	РазрешительныйРежимМДЛПКлиент.ИнициализироватьКонфигурациюЛМЧЗ(ПараметрыЗапроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьПроцедуруСменыПароляАдминистратораЛокальногоМодуля(НовыйПароль)
	
	Элементы.СтраницыПроверкаПодключения.ТекущаяСтраница = Элементы.СтраницаИдетНастройка;
	ДополнительныеПараметры = Новый Структура("НовыйПароль", НовыйПароль);
	ПослеВыполненияОбновления = Новый ОписаниеОповещения("ПослеПолученияРезультатаИзмененияПароляЛокальногоМодуля", ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыУстановки = РазрешительныйРежимМДЛПКлиентСервер.ПараметрыПодключенияЛокальногоМодуляЧЗ();
	ПараметрыУстановки.Адрес                = Запись.СерверПодключенияЛМ;
	ПараметрыУстановки.ЗащищенноеСоединение = Запись.ЗащищенноеСоединение;
	ПараметрыУстановки.Порт                 = Запись.ПортПодключенияЛМ;
	ПараметрыУстановки.Логин                = Запись.Логин;
	ПараметрыУстановки.ФорматОбмена         = Запись.ФорматОбмена;
	ПараметрыУстановки.Пароль               = Пароль;
	
	ПараметрыОбработки = Новый Структура();
	ПараметрыОбработки.Вставить("Организация",            Запись.Организация);
	ПараметрыОбработки.Вставить("ПараметрыУстановки",     ПараметрыУстановки);
	ПараметрыОбработки.Вставить("НовыйПароль",            НовыйПароль);
	ПараметрыОбработки.Вставить("НеВыводитьОкноОжидания", Истина);
	
	ПараметрыЗапроса                         = РазрешительныйРежимМДЛПКлиент.ПараметрыЗапросаДанных();
	ПараметрыЗапроса.ОповещениеОЗавершении   = ПослеВыполненияОбновления;
	ПараметрыЗапроса.УникальныйИдентификатор = УникальныйИдентификатор;
	ПараметрыЗапроса.Параметры               = ПараметрыОбработки;
	ПараметрыЗапроса.Организация             = Запись.Организация;
	ПараметрыЗапроса.ВыполнениеНаКлиенте     = Не Запись.ОбменНаСервере;
	
	РазрешительныйРежимМДЛПКлиент.ИзменитьПарольДоступаКЛокальнойКонфигурацииЛМЧЗ(ПараметрыЗапроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодтвержденияЗапускаИнициализацииЛокальногоМодуля(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не Результат = КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	Если Записать() Тогда
		ЗапуститьПроцессИнициализацииЛокальногоМодуля();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодтвержденияПолученияСтатусаЛокальногоМодуля(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не Результат = КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	Если Записать() Тогда
		ЗапуститьПроверкуСтатусаЛогинаПароляАдминистратораЛокальногоМодуля(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыполненияПроверкиЛогинаПароляАдминистратора(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.ЕстьОшибки Тогда
		
		Элементы.СтраницыПроверкаПодключения.ТекущаяСтраница = Элементы.СтраницаПроверкаНеВыполнена;
		
		ШаблонСообщения = НСтр("ru = 'Не удалось подключиться к локальному модулю.
							   |Описание ошибки: %1.'");
							   
		ТекстСообщения = СтрШаблон(ШаблонСообщения, Результат.ТекстОшибки);
		ПоказатьПредупреждение(, ТекстСообщения);
		
	Иначе
		
		Если Результат.Свойство("Результат") И ТипЗнч(Результат.Результат) = Тип("Структура") Тогда
			
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Результат.Результат, "ОтказАвторизации")
				И Результат.Результат.ОтказАвторизации Тогда
				
				Элементы.СтраницыПроверкаПодключения.ТекущаяСтраница = Элементы.СтраницаПроверкаНеВыполнена;
				
				ТекстСообщения = НСтр("ru = 'Авторизация не успешна.
										  |Проверьте указание корректного логина/пароля администратора к Локальному модулю.'");
										  
				ПоказатьПредупреждение(, ТекстСообщения);
				
			Иначе
				
				СтатусСистемы              = Результат.Результат.Статус;
				ДатаПоследнейСинхронизации = Результат.Результат.ДатаПоследнейСинхронизации;
				
				ОбновитьДанныеПодключенияПоДаннымЛокальногоМодуля();
				
				Если ДополнительныеПараметры.Свойство("ОжидатьПолучениеСтатусаГотовности")
					И ДополнительныеПараметры.ОжидатьПолучениеСтатусаГотовности Тогда
					
					Если Не ВРег(СтатусСистемы) = СтатусГотово() Тогда
						
						Если Не ЗакончитьПолучениеСтатуса Тогда
							
							ПодключитьОбработчикОжидания("ПовторноЗапуститьПроверкуСтатуса", 1, Истина);
							
						Иначе
							
							Элементы.СтраницыПроверкаПодключения.ТекущаяСтраница = Элементы.СтраницаИдетНастройка;
							
							ИдетДлительнаяОперацияНастройки = Ложь;
							ЗапущеноОжиданиеСтатуса         = Ложь;
							
						КонецЕсли;
						
					Иначе
						
						ИдетДлительнаяОперацияНастройки = Ложь;
						
						Элементы.СтраницыСтатусНастройки.ТекущаяСтраница     = Элементы.СтраницаНастройкаЗавершена;
						Элементы.СтраницыПроверкаПодключения.ТекущаяСтраница = Элементы.СтраницаПроверкаВыполнена;
						
						УстановитьОтображениеДатыПоследнейСинхронизации(ЭтотОбъект);
						
					КонецЕсли;
					
				Иначе
					
					Элементы.СтраницыПроверкаПодключения.ТекущаяСтраница = Элементы.СтраницаПроверкаВыполнена;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	УправлениеВидимостьюДоступностью(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыполненияЭтапаИнициализации(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если Результат.ЕстьОшибки Тогда
		
		Если Результат.ОтказОтАвторизации Тогда
			
			Элементы.СтраницыПроверкаПодключения.ТекущаяСтраница = Элементы.СтраницаПроверкаВыполнена;
			
		Иначе
		
			Элементы.СтраницыПроверкаПодключения.ТекущаяСтраница = Элементы.СтраницаОшибкаНастройки;
			
			ШаблонСообщения = НСтр("ru = 'Не удалось подключиться к локальному модулю.
								   |Описание ошибки: %1.'");
								   
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Результат.ТекстОшибки);
			ПоказатьПредупреждение(, ТекстСообщения);
		
		КонецЕсли;
		
		ИдетДлительнаяОперацияНастройки = Ложь;
		
	Иначе
		
		Если Результат.Свойство("Результат") И ТипЗнч(Результат.Результат) = Тип("Структура") Тогда
			
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Результат.Результат, "ТребуетсяОбновлениеКлючаСессииРозница")
				И Результат.Результат.ТребуетсяОбновлениеКлючаСессииРозница Тогда
				
				Элементы.СтраницыПроверкаПодключения.ТекущаяСтраница = Элементы.СтраницаОшибкаНастройки;
				
				ШаблонСообщения = НСтр("ru = 'Проверьте наличие розничного токена по организации %1.'");
				ТекстСообщения  = СтрШаблон(ШаблонСообщения, Запись.Организация);
				
				ПоказатьПредупреждение(, ТекстСообщения);
				
				ИдетДлительнаяОперацияНастройки = Ложь;
				
			ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Результат.Результат, "ОтказАвторизации")
				И Результат.Результат.ОтказАвторизации Тогда
				
				Элементы.СтраницыПроверкаПодключения.ТекущаяСтраница = Элементы.СтраницаОшибкаНастройки;
				
				ТекстСообщения = НСтр("ru = 'Авторизация не успешна.
										  |Проверьте указание корректного логина/пароля администратора к Локальному модулю.'");
										  
				ПоказатьПредупреждение(, ТекстСообщения);
				
				ИдетДлительнаяОперацияНастройки = Ложь;
				
			Иначе
				
				ЗапуститьПроверкуСтатусаЛогинаПароляАдминистратораЛокальногоМодуля(Истина);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	УправлениеВидимостьюДоступностью(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПолученияРезультатаИзмененияПароляЛокальногоМодуля(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.ЕстьОшибки Тогда
		
		Элементы.СтраницыПроверкаПодключения.ТекущаяСтраница = Элементы.СтраницаОшибкаНастройки;
		
		ШаблонСообщения = НСтр("ru = 'Не удалось подключиться к локальному модулю.
							   |Описание ошибки: %1.'");
							   
		ТекстСообщения = СтрШаблон(ШаблонСообщения, Результат.ТекстОшибки);
		ПоказатьПредупреждение(, ТекстСообщения);
		
	Иначе
		
		Если Результат.Свойство("Результат") И ТипЗнч(Результат.Результат) = Тип("Структура") Тогда
			
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Результат.Результат, "ОтказАвторизации")
				И Результат.Результат.ОтказАвторизации Тогда
				
				Элементы.СтраницыПроверкаПодключения.ТекущаяСтраница = Элементы.СтраницаОшибкаНастройки;
				
				ТекстСообщения = НСтр("ru = 'Авторизация не успешна.
										  |Проверьте указание корректного логина/пароля администратора к Локальному модулю.'");
										  
				ПоказатьПредупреждение(, ТекстСообщения);
				
			Иначе
				
				СохранитьНовыйПарольНаСервере(ДополнительныеПараметры.НовыйПароль);
				
				ТекстСообщения = НСтр("ru = 'Пароль успешно изменен.'");
				ПоказатьПредупреждение(, ТекстСообщения);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодтвержденияУстановкиНовогоДистрибутиваЛМЧЗ(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	Запись.ФорматОбмена = ДополнительныеПараметры.НовоеЗначение;
	Модифицированность  = Истина;
	
	УправлениеПодсказкойФорматОбмена(ЭтотОбъект);
	ПроверитьНастройкиПодключения();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНавигационнуюСсылку(Знач НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ПроверитьПодключениеЛМЧЗ" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если ПроверитьКорректностьЗаполненияНастроек() Тогда
			ВыполнитьПроверкуПодключенияЛМЧЗНачало();
		Иначе
			ПоказатьПредупреждение(, НСтр("ru = 'Укажите настройки подключения и попробуйте снова.'"));
		КонецЕсли;
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ПовторитьНастройкуЛМЧЗ" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если ВРег(СтатусСистемы) = СтатусНеНастроено() Тогда
			ЗапуститьПроцессИнициализацииЛокальногоМодуля();
		ИначеЕсли ВРег(СтатусСистемы) = СтатусИнициализация() Тогда
			ЗапуститьПроцессИнициализацииЛокальногоМодуля();
		ИначеЕсли ВРег(СтатусСистемы) = СтатусОшибкиСинхронизации() Тогда
			
			ТекстСообщения = НСтр("ru = 'С момента последней успешной синхронизации БД превышено ожидаемое время.
							  |Необходимо синхронизироваться с центральной системой для продолжения работы.'");
							  
			ПоказатьПредупреждение(, ТекстСообщения);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПроверкуПодключенияЛМЧЗНачало() Экспорт
	
	СтатусСистемы              = "";
	ДатаПоследнейСинхронизации = Дата(1, 1, 1);
	
	Элементы.СтраницыПроверкаПодключения.ТекущаяСтраница = Элементы.СтраницаПроверкаНеВыполнялась;
	
	Если Не Запись.ОбменНаСервере
		И ЗначениеЗаполнено(Запись.РабочееМесто)
		И Не Запись.РабочееМесто = ТекущееРабочееМесто Тогда
		Возврат;
	КонецЕсли;
	
	ЗапуститьПроверкуСтатусаЛогинаПароляАдминистратораЛокальногоМодуля();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеВидимостьюДоступностью(Форма)
	
	Элементы = Форма.Элементы;
	Запись   = Форма.Запись;
	
	Элементы.РабочееМесто.Доступность = Не Запись.ОбменНаСервере;
	
	Если ЗначениеЗаполнено(Запись.РабочееМесто) И Запись.ОбменНаСервере Тогда
		Запись.РабочееМесто = Неопределено;
	КонецЕсли;
	
	Элементы.НадписьПроверитьСтатус.Видимость = Форма.ЗакончитьПолучениеСтатуса И ВРег(Форма.СтатусСистемы) = СтатусИнициализация();
	
	Если ВРег(Форма.СтатусСистемы) = СтатусНеНастроено() Тогда
		
		Элементы.СтраницыСтатусНастройки.ТекущаяСтраница = Элементы.СтраницаЗапуститьИнициализацию;
		
	ИначеЕсли ВРег(Форма.СтатусСистемы) = СтатусГотово() Тогда
		
		Элементы.СтраницыСтатусНастройки.ТекущаяСтраница = Элементы.СтраницаНастройкаЗавершена;
		
	ИначеЕсли ВРег(Форма.СтатусСистемы) = СтатусОшибкиСинхронизации() Тогда
		
		Элементы.СтраницыСтатусНастройки.ТекущаяСтраница = Элементы.СтраницаОшибкаСинхронизации;
		
	ИначеЕсли ЗначениеЗаполнено(Форма.СтатусСистемы) И Не Форма.СтатусСистемы = СтатусИнициализация() Тогда
		
		Элементы.СтраницыСтатусНастройки.ТекущаяСтраница = Элементы.СтраницаИныеСтатусы;
		
	КонецЕсли;
	
	УстановитьОтображениеДатыПоследнейСинхронизации(Форма);
	Элементы.Изменить.Доступность = ЗначениеЗаполнено(Форма.СтатусСистемы);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеПодсказкойФорматОбмена(Форма)
	
	Элементы = Форма.Элементы;
	Запись   = Форма.Запись;
	
	Если Запись.ФорматОбмена = ПредопределенноеЗначение("Перечисление.ВерсииФорматаОбменаЛокальногоМодуляМДЛП.V2") Тогда
		
		Элементы.ГруппаФорматОбмена.ЦветФона = Новый Цвет();
		Элементы.ФорматОбмена.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
		
	Иначе
		
		Элементы.ГруппаФорматОбмена.ЦветФона = Форма.ЦветПодсказки;
		Элементы.ФорматОбмена.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьКорректностьЗаполненияНастроек()
	
	Возврат ЗначениеЗаполнено(Запись.СерверПодключенияЛМ)
		И ЗначениеЗаполнено(Запись.ПортПодключенияЛМ)
		И ЗначениеЗаполнено(Запись.Логин)
		И ЗначениеЗаполнено(Пароль);
	
КонецФункции

&НаКлиенте
Процедура ПроверитьНастройкиПодключения()
	
	Если ПроверитьКорректностьЗаполненияНастроек() Тогда
		ПодключитьОбработчикОжидания("ВыполнитьПроверкуПодключенияЛМЧЗНачало", 1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтображениеДатыПоследнейСинхронизации(Форма)
	
	Элементы = Форма.Элементы;
	
	Если ЗначениеЗаполнено(Форма.ДатаПоследнейСинхронизации) Тогда
		Элементы.СтраницыПредставлениеДатыПоследнейСинхронизации.ТекущаяСтраница = Элементы.СтраницаДатаСинхронизации;
	Иначе
		Элементы.СтраницыПредставлениеДатыПоследнейСинхронизации.ТекущаяСтраница = Элементы.СтраницаНетДатыСинхронизации;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеПодключенияПоДаннымЛокальногоМодуля()
	
	ПредставлениеСтатусаСистемы = СтатусЛокальногоМодуляЧестныйЗнак(СтатусСистемы);
	
	Если ВРег(СтатусСистемы) = СтатусГотово() Тогда
		
		ШаблонСтроки   = НСтр("ru = 'Статус подключения: <b>%1</b>'");
		ТекстПодсказки = "";
		
	ИначеЕсли ВРег(СтатусСистемы) = СтатусОшибкиСинхронизации() Тогда
		
		ШаблонСтроки = НСтр("ru = 'Статус подключения: <span style=""color:ЦветТекстаТребуетВниманияГосИС""><b>%1</b></span>'");
		ТекстПодсказки = НСтр("ru = 'С момента последней успешной синхронизации БД превышено ожидаемое время.
							  |Необходимо синхронизироваться с центральной системой для продолжения работы.'");
							  
	ИначеЕсли ЗначениеЗаполнено(СтатусСистемы) Тогда
		
		ШаблонСтроки   = НСтр("ru = 'Статус подключения: <b>%1</b>'");
		ТекстПодсказки = НСтр("ru = 'Работа с Локальным модулем возможна только в статусе Готово к использованию.
							  |Завершите настройку модуля.'");
		
	Иначе
		
		ШаблонСтроки = НСтр("ru = 'Статус подключения: <span style=""color:ЦветНедоступногоТекста"">%1</span>'");
		ТекстПодсказки = "";
		
	КонецЕсли;
	
	Элементы.НадписьПредставлениеСтатусаСистемы.Заголовок = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
		СтрШаблон(ШаблонСтроки, ПредставлениеСтатусаСистемы));
	
	Элементы.НадписьПредставлениеСтатусаСистемы.Подсказка = ТекстПодсказки;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииЧтенииНаСервере()
	
	ЦветПодсказки = ЦветаСтиля.ЦветФонаПодсказки;
	
	УстановитьЗначенияПриоритетовНастроек(ЭтотОбъект);
	
	УправлениеПодсказкойФорматОбмена(ЭтотОбъект);
	УправлениеВидимостьюДоступностью(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗначенияПриоритетовНастроек(Форма)
	
	Запись   = Форма.Запись;
	Элементы = Форма.Элементы;
	
	Элементы.Приоритет.СписокВыбора.Очистить();
	
	ПриоритетРезервный = ?(Запись.Приоритет = 0, 999, Запись.Приоритет);
	
	Элементы.Приоритет.СписокВыбора.Добавить(0,                  НСтр("ru = 'Основной'"));
	Элементы.Приоритет.СписокВыбора.Добавить(ПриоритетРезервный, НСтр("ru = 'Резервный'"));
	
КонецПроцедуры

// Представление статуса Локального модуля "Честный знак" по данным системы
// 
// Параметры:
//  СтатусСистемы - Строка - статус, полученный из ЛМ ЧЗ по 
// 
// Возвращаемое значение:
//  Строка - читаемое представление статуса
Функция СтатусЛокальногоМодуляЧестныйЗнак(СтатусСистемы)
	
	ПредставлениеСтатуса = "";
	
	Если ВРег(СтатусСистемы) = СтатусНеНастроено() Тогда
		ПредставлениеСтатуса = "не настроено";
	ИначеЕсли ВРег(СтатусСистемы) = СтатусИнициализация() Тогда
		ПредставлениеСтатуса = "инициализация";
	ИначеЕсли ВРег(СтатусСистемы) = СтатусГотово() Тогда
		ПредставлениеСтатуса = "готово к использованию";
	ИначеЕсли ВРег(СтатусСистемы) = СтатусОшибкиСинхронизации() Тогда
		ПредставлениеСтатуса = "ошибка синхронизации";
	ИначеЕсли Не ЗначениеЗаполнено(СтатусСистемы) Тогда
		ПредставлениеСтатуса = "неопределено";
	Иначе
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Внутренняя ошибка. Не определено представление статуса для статуса системы %1'"), СтатусСистемы);
	КонецЕсли;
	
	Возврат ПредставлениеСтатуса;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СтатусОшибкиСинхронизации()
	
	Возврат "SYNC_ERROR";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СтатусНеНастроено()
	
	Возврат "NOT_CONFIGURED";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СтатусИнициализация()
	
	Возврат "INITIALIZATION";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СтатусГотово()
	
	Возврат "READY";
	
КонецФункции

&НаКлиенте
Процедура ПослеПодтвержденияЗавершенияНастройки(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ИдетДлительнаяОперацияНастройки = Ложь;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеИзмененияПароляЛокальногоМодуля(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗапуститьПроцедуруСменыПароляАдминистратораЛокальногоМодуля(Результат);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНовыйПарольНаСервере(НовыйПароль)
	
	Пароль = НовыйПароль;
	
	РегистрыСведений.НастройкиПодключенияЛокальныхМодулейМДЛП.СохранитьПарольАдминистратораВБезопасноеХранилище(
		Запись.ХешСумма, НовыйПароль);
	
КонецПроцедуры

&НаКлиенте
Процедура ПовторноЗапуститьПроверкуСтатуса() Экспорт
	
	ЗапуститьПроверкуСтатусаЛогинаПароляАдминистратораЛокальногоМодуля(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьОжиданиеПереходаСистемыВСтатусГотовности() Экспорт
	
	ЗакончитьПолучениеСтатуса = Истина;
	
КонецПроцедуры

#КонецОбласти
